app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "city", "state", "zip", "description", "category") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Pasta House"], ["address", "5 Alden Rd"], ["city", "Fairhaven"], ["state", "MA"], ["zip", "02719"], ["description", "Great homestyle Italian food."], ["category", "Italian"]]