app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 92]]
INSERT INTO "reviews" ("rating", "body", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 5], ["body", "Best I've ever had!"], ["restaurant_id", 92], ["created_at", "2015-09-18 15:37:34.964503"], ["updated_at", "2015-09-18 15:37:34.964503"]]
---
  def create
    @review = Review.new(review_params)
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review.restaurant = @restaurant
    if @review.save